Revit 2026 API

# MEPSystemTypeAbbreviation Property

---

Identifies the abbreviation, the short name, for the system type

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public string Abbreviation { get; set; }
```
```vb
Public Property Abbreviation As String
	Get
	Set
```
```cpp
public:
property String^ Abbreviation {
	String^ get ();
	void set (String^ value);
}
```
```fsharp
member Abbreviation : string with get, set
```

#### Property Value

String

| Exception | Condition |
| --- | --- |
| ArgumentNullException | When setting this property: A non-optional argument was null |

#### Reference

MEPSystemType Class

Autodesk.Revit.DB Namespace